# Retirando valores duplicados

Irei exemplificar como retirar valores duplicados de um DataFrame. Podemos verificar que há 2 Carlos com todos os dados iguais na base criada abaixo. Neste caso podemos concluir que por algum erro, o Carlos (ID 101) apresentou seus dados duplicados. É de suma importância remover dados duplicados, eles podem prejudicar no entendimento dos dados e na modelagem de algoritmos de Machine Learning.

Para realizar tal tarefa, iremos utilizar o método `.drop_duplicates()`.

- [Documentação do método drop_duplicates](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop_duplicates.html)

In [1]:
import pandas as pd
import numpy as np

In [2]:
matriz = [['Carlos', 32, 'Chocolate', 101],
          ['Maria',  23, 'Baunilha',  209],
          ['Julia',  24, 'Creme',     290],
          ['Carlos', 32, 'Chocolate', 101],
          ['Julia',  29, 'Baunilha',  293]]
data = pd.DataFrame(matriz, columns=['Nome', 'Idade',
                                     'Sorvete favorito', 'ID'])

In [3]:
data

     Nome  Idade Sorvete favorito   ID
0  Carlos     32        Chocolate  101
1   Maria     23         Baunilha  209
2   Julia     24            Creme  290
3  Carlos     32        Chocolate  101
4   Julia     29         Baunilha  293

In [4]:
data2 = data.drop_duplicates()

In [5]:
data2

     Nome  Idade Sorvete favorito   ID
0  Carlos     32        Chocolate  101
1   Maria     23         Baunilha  209
2   Julia     24            Creme  290
4   Julia     29         Baunilha  293